req.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsd="http://schemas.xmlsoap.org/ws/2005/04/discovery"><soap:Header><wsa:To>urn:schemas-xmlsoap-org:ws:2005:04:discovery</wsa:To><wsa:Action>http://schemas.xmlsoap.org/ws/2005/04/discovery/Bye</wsa:Action><wsa:MessageID>urn:uuid:44ba1f64-d262-4033-99f0-4667c17274ec</wsa:MessageID><wsd:AppSequence InstanceId="83" SequenceId="urn:uuid:7880afe1-e5ff-4b4e-becc-e38c3442862a" MessageNumber="354"></wsd:AppSequence></soap:Header><soap:Body><wsd:Bye><wsa:EndpointReference><wsa:Address>urn:uuid:20a68289-3e1b-4c1d-bf44-9c6ebc852486</wsa:Address></wsa:EndpointReference></wsd:Bye></soap:Body></soap:Envelope>